In [1]:
%load_ext autoreload
%autoreload 2

In [2]:
from LocalSQLEngine import *

In [3]:
database = 'sqlite:///sqlite_db_pythonsqlite.db'
# create connection
conn = create_sql_engine(database)
table = select_table(conn)

connection established
(0, 'Tennis Court 1', 5, 25, 10000, 200)
(1, 'Tennis Court 2', 5, 25, 8000, 200)
(2, 'Badminton Court', 0, 15.5, 4000, 50)
(3, 'Table Tennis', 0, 5, 320, 10)
(4, 'Massage Room 1', 9.9, 80, 4000, 3000)
(5, 'Massage Room 2', 9.9, 80, 4000, 3000)
(6, 'Squash Court', 3.5, 17.5, 5000, 80)
(7, 'Snooker Table', 0, 5, 450, 15)
(8, 'Pool Table', 0, 5, 400, 15)

In [4]:
# Q10: Produce a list of facilities with a total revenue less than 1000.
# The output of facility name and total revenue, sorted by revenue. Remember
# that there's a different cost for guests and members!

query10 = '''SELECT facility, SUM(revenue) AS facility_revenue
           FROM (SELECT f.name as facility,
                        CASE WHEN b.memid = 0 THEN f.guestcost*slots
                        ELSE f.membercost*slots END AS revenue
                 FROM Bookings as b
                 LEFT JOIN Members as m
                 ON b.memid = m.memid
                 LEFT JOIN Facilities as f
                 ON b.facid = f.facid) AS total_booking
            GROUP BY facility
            HAVING facility_revenue < 1000
            ORDER BY SUM(revenue);'''

call_query(conn, query10)

               0    1
0   Table Tennis  180
1  Snooker Table  240
2     Pool Table  270

In [5]:
# Q11: Produce a report of members and who recommended them in alphabetic surname,firstname order

query11 = '''SELECT m1.surname || ' ' || m1.firstname as member_name,
                    CASE WHEN m1.recommendedby=' ' THEN 'None'
                    ELSE m2.surname || ' ' || m2.firstname END as recommendee_name
             FROM Members as m1
             LEFT JOIN Members as m2
             ON m1.recommendedby = m2.memid
             ORDER BY member_name;'''

call_query(conn, query11)

                          0                  1
0            Bader Florence    Stibbons Ponder
1                Baker Anne    Stibbons Ponder
2             Baker Timothy     Farrell Jemima
3                Boothe Tim         Rownam Tim
4            Butters Gerald       Smith Darren
5               Coplin Joan      Baker Timothy
6             Crumpet Erica        Smith Tracy
7                Dare Nancy    Joplette Janice
8             Farrell David               None
9            Farrell Jemima               None
10              GUEST GUEST               None
11          Genting Matthew     Butters Gerald
12                Hunt John  Purview Millicent
13              Jones David    Joplette Janice
14            Jones Douglas        Jones David
15          Joplette Janice       Smith Darren
16           Mackenzie Anna       Smith Darren
17             Owen Charles       Smith Darren
18             Pinker David     Farrell Jemima
19        Purview Millicent        Smith Tracy
20               Rownam Tim               None
21         Rumney Henrietta    Genting Matthew
22         Sarwin Ramnaresh     Bader Florence
23             Smith Darren               None
24             Smith Darren               None
25               Smith Jack       Smith Darren
26              Smith Tracy               None
27          Stibbons Ponder       Tracy Burton
28             Tracy Burton               None
29      Tupperware Hyacinth               None
30  Worthington-Smyth Henry        Smith Tracy

In [8]:
# Q12: Find the facilities with their usage by member, but not guests
#question unclear...is this asking total number of uses of each facility by member?
#or is this asking how many facilities are used by each member?
#query12 = '''SELECT member, SUM(used) AS facilities_used
#             FROM(SELECT DISTINCT m.memid, 
#                        firstname || ' ' || surname as member, name as facility,
#                        CASE WHEN b.memid = 0 THEN 0
#                        ELSE 1 END as used
#                  FROM Facilities AS f
#                  LEFT JOIN Bookings AS b
#                  ON f.facid = b.facid
#                  LEFT JOIN Members AS m
#                  ON b.memid = m.memid) facility_usage
#            WHERE member != 'GUEST GUEST'
#            GROUP BY member;'''

                    0                1    2
0      Anna Mackenzie  Badminton Court   30
1          Anne Baker  Badminton Court   10
2        Burton Tracy  Badminton Court    2
3        Charles Owen  Badminton Court    6
4        Darren Smith  Badminton Court  132
..                ...              ...  ...
197  Ramnaresh Sarwin   Tennis Court 2   11
198        Tim Boothe   Tennis Court 2   52
199        Tim Rownam   Tennis Court 2    6
200     Timothy Baker   Tennis Court 2    7
201       Tracy Smith   Tennis Court 2    2

[202 rows x 3 columns]

In [7]:
# Q13: Find the facilities usage by month, but not guests

query13 = '''SELECT month, facility, SUM(used) AS total_usage
             FROM (SELECT strftime('%m', starttime) as month, name as facility, 
                   CASE WHEN b.memid = 0 THEN 0
                   ELSE 1 END as used
                   FROM Facilities AS f
                   LEFT JOIN Bookings AS b
                   ON f.facid = b.facid
                   LEFT JOIN Members AS m
                   ON b.memid = m.memid) AS facilities_used
            GROUP BY month, facility;'''

call_query(conn, query13)

     0                1    2
0   07  Badminton Court   51
1   07   Massage Room 1   77
2   07   Massage Room 2    4
3   07       Pool Table  103
4   07    Snooker Table   68
5   07     Squash Court   23
6   07     Table Tennis   48
7   07   Tennis Court 1   65
8   07   Tennis Court 2   41
9   08  Badminton Court  132
10  08   Massage Room 1  153
11  08   Massage Room 2    9
12  08       Pool Table  272
13  08    Snooker Table  154
14  08     Squash Court   85
15  08     Table Tennis  143
16  08   Tennis Court 1  111
17  08   Tennis Court 2  109
18  09  Badminton Court  161
19  09   Massage Room 1  191
20  09   Massage Room 2   14
21  09       Pool Table  408
22  09    Snooker Table  199
23  09     Squash Court   87
24  09     Table Tennis  194
25  09   Tennis Court 1  132
26  09   Tennis Court 2  126